{
  "generatedAt": "2026-02-13T17:00:00Z",
  "generatedBy": "stocks-agent",
  "feedType": "stocks",
  "title": "Daily Market Digest",
  "subtitle": "February 13, 2026 Market Close",
  "badge": "Updated Today",
  "sections": [
    {
      "id": "market-pulse",
      "title": "Market Pulse",
      "cardType": "breaking",
      "layout": "featured",
      "items": [
        {
          "id": "market-summary-feb13",
          "headline": "Mixed Close for US Markets as Inflation Cools, AI Worries Persist; Indian Indices Tumble",
          "summary": "U.S. markets saw a relatively steady close on Friday, February 13, 2026, finding some calm after a report indicated January inflation slowed more than expected. However, ongoing concerns about artificial intelligence disrupting various industries continued to cast a shadow, particularly over technology stocks. Meanwhile, benchmark Indian equity indices, Sensex and Nifty, experienced a significant broad-based selloff, primarily driven by weak global market cues and sharp declines in the metal and IT sectors. Not financial advice.",
          "tags": [
            "Market Overview",
            "Inflation",
            "AI Impact",
            "Global Markets"
          ],
          "timestamp": "2026-02-13T17:00:00Z"
        }
      ]
    },
    {
      "id": "major-indices",
      "title": "Major Indices",
      "cardType": "stat",
      "layout": "grid",
      "items": [
        {
          "id": "sp500-performance",
          "statLabel": "S&P 500",
          "statValue": "~6,830.00",
          "statContext": "Nearly unchanged."
        },
        {
          "id": "nasdaq-performance",
          "statLabel": "NASDAQ Composite",
          "statValue": "~22,529.00",
          "statContext": "Down 0.3%."
        },
        {
          "id": "dow-performance",
          "statLabel": "Dow Jones Industrial Average",
          "statValue": "~49,352.00",
          "statContext": "Down 109 points, or 0.2%."
        }
      ]
    },
    {
      "id": "top-movers",
      "title": "Top Movers",
      "cardType": "stock",
      "layout": "grid",
      "items": [
        {
          "id": "usfd-gainer",
          "headline": "US Foods Holding surges on strong earnings",
          "ticker": "$USFD",
          "price": "$51.03",
          "change": "+$6.03",
          "changePercent": "+13.40%",
          "direction": "up",
          "summary": "US Foods Holding saw a significant jump after reporting strong Q4 earnings and providing optimistic 2026 guidance."
        },
        {
          "id": "eqix-gainer",
          "headline": "Equinix gains as price targets raised",
          "ticker": "$EQIX",
          "price": "$772.87",
          "change": "+$72.87",
          "changePercent": "+10.41%",
          "direction": "up",
          "summary": "Equinix experienced a notable rise as several banks increased their price targets following the company's recent earnings and guidance."
        },
        {
          "id": "msi-gainer",
          "headline": "Motorola Solutions up on positive outlook",
          "ticker": "$MSI",
          "price": "$323.01",
          "change": "+$23.01",
          "changePercent": "+7.67%",
          "direction": "up",
          "summary": "Motorola Solutions shares climbed after the company issued strong 2026 guidance and reported solid fourth-quarter results."
        },
        {
          "id": "asts-loser",
          "headline": "AST SpaceMobile drops on equity offering news",
          "ticker": "$ASTS",
          "price": "$8.48",
          "change": "-$1.52",
          "changePercent": "-15.17%",
          "direction": "down",
          "summary": "AST SpaceMobile shares declined following the announcement of a follow-on equity offering."
        },
        {
          "id": "pins-loser",
          "headline": "Pinterest plunges amid tech sector weakness",
          "ticker": "$PINS",
          "price": "$14.55",
          "change": "-$3.99",
          "changePercent": "-21.57%",
          "direction": "down",
          "summary": "Pinterest shares saw a significant drop in pre-market trading, reflecting broader weakness in the technology sector."
        },
        {
          "id": "mco-loser",
          "headline": "Moody's falls on AI disruption fears",
          "ticker": "$MCO",
          "price": "$269.50",
          "change": "-$80.50",
          "changePercent": "-23.00%",
          "direction": "down",
          "summary": "Moody's stock fell sharply due to growing fears that advanced AI technology could erode its competitive advantages."
        }
      ]
    },
    {
      "id": "sector-analysis",
      "title": "Sector Analysis",
      "cardType": "article",
      "layout": "list",
      "items": [
        {
          "id": "sector-rotation",
          "headline": "Rotation Away from Tech as Industrials, Energy Lead",
          "summary": "There is a notable shift in sector preferences among US equity investors, with Industrials, Energy, and Basic Materials gaining favor. This rotation is partly driven by skepticism over AI investment, leading to a decreased preference for AI-related and technology stocks, which had been strong performers in late 2025. Utilities and Consumer Staples also showed resilience.",
          "tags": [
            "Sector Performance",
            "Market Trends",
            "AI Impact"
          ]
        },
        {
          "id": "tech-financials-lag",
          "headline": "Technology and Financials Continue to Lag",
          "summary": "Technology, Financials, and Communication Services sectors were among the worst performers. Financials have emerged as the weakest corner of the S&P 500 year-to-date, reflecting mounting pressure on banks and insurers. Concerns about AI disruption continue to weigh heavily on the tech and software industries.",
          "tags": [
            "Lagging Sectors",
            "Technology",
            "Financials"
          ]
        }
      ]
    },
    {
      "id": "economic-news",
      "title": "Economic News",
      "cardType": "article",
      "layout": "list",
      "items": [
        {
          "id": "cpi-report",
          "headline": "January Inflation Cools More Than Expected, CPI at 2.4%",
          "summary": "The Consumer Price Index (CPI) report for January showed inflation slowing to 2.4% year-over-year, down from 2.7% in December, and below economists' expectations. Core inflation also moderated to 2.5%. This cooling trend provides the Federal Reserve with more flexibility, reinforcing a cautious stance on immediate interest rate cuts.",
          "tags": [
            "Economic Data",
            "Inflation",
            "Federal Reserve"
          ]
        },
        {
          "id": "labor-market",
          "headline": "US Labor Market Shows Strength with 130,000 Jobs Added",
          "summary": "The US labor market continued to show strength in January, with 130,000 jobs added and the unemployment rate falling to 4.3%. This positive data suggests improving labor market conditions.",
          "tags": [
            "Economic Data",
            "Employment",
            "Labor Market"
          ]
        },
        {
          "id": "earnings-updates",
          "headline": "Key Companies Report Q4 and Full-Year Results",
          "summary": "Cameco Corp. ($CCJ) reported strong Q4 net earnings of $199 million, beating analyst expectations. Kinsale Capital Group, Inc. ($KNSL) also surpassed estimates with a 25.8% rise in Q4 net operating EPS and increased its dividend. The Wendy's Company ($WEN) released Q4 and full-year 2025 results, aligning with expectations. American Axle & Manufacturing ($AAM) also announced its Q4 financial results today.",
          "tags": [
            "Earnings Reports",
            "Company News"
          ]
        }
      ]
    }
  ]
}