{
  "generatedAt": "2026-02-12T17:03:00Z",
  "generatedBy": "stocks-agent",
  "feedType": "stocks",
  "title": "Daily Market Digest: February 12, 2026",
  "subtitle": "A professional overview of today's market movements.",
  "badge": "LIVE",
  "sections": [
    {
      "id": "market-pulse",
      "title": "Market Pulse",
      "cardType": "breaking",
      "layout": "featured",
      "items": [
        {
          "id": "market-summary-feb12",
          "headline": "U.S. Stocks Show Mixed Performance Amid Strong Jobs Report and Inflation Watch",
          "summary": "U.S. equities experienced a day of cautious optimism and mixed signals on Thursday, February 12, 2026. Major indices generally moved higher, reacting to a surprisingly robust January jobs report released earlier in the week, which saw nonfarm payrolls increase by 130,000 and the unemployment rate dip to 4.3%. However, this strong economic data also intensified speculation regarding the Federal Reserve's next policy moves, leading to a tempering of interest rate cut expectations. Investors are now keenly awaiting Friday's Consumer Price Index (CPI) inflation report, which is expected to show a slight easing of inflation. Trading volumes were lower than the 20-session average.",
          "tags": [
            "Market Overview",
            "Jobs Report",
            "Inflation",
            "Fed"
          ]
        }
      ]
    },
    {
      "id": "major-indices",
      "title": "Major Indices",
      "cardType": "stat",
      "layout": "grid",
      "items": [
        {
          "id": "sp500-performance",
          "statLabel": "S&P 500",
          "statValue": "6,967.08",
          "statContext": "Up 25.61 points (+0.3%)",
          "ticker": "$SPX",
          "price": "6,967.08",
          "change": "+25.61",
          "changePercent": "+0.3%",
          "direction": "up"
        },
        {
          "id": "nasdaq-performance",
          "statLabel": "NASDAQ Composite",
          "statValue": "23,146.07",
          "statContext": "Up 79.61 points (+0.4%)",
          "ticker": "$IXIC",
          "price": "23,146.07",
          "change": "+79.61",
          "changePercent": "+0.4%",
          "direction": "up"
        },
        {
          "id": "dow-performance",
          "statLabel": "Dow Jones Industrial Average",
          "statValue": "50,330.70",
          "statContext": "Up 295 points (+0.6%)",
          "ticker": "$DJI",
          "price": "50,330.70",
          "change": "+295",
          "changePercent": "+0.6%",
          "direction": "up"
        }
      ]
    },
    {
      "id": "top-movers",
      "title": "Top Movers",
      "cardType": "stock",
      "layout": "grid",
      "items": [
        {
          "id": "equinix-gainer",
          "headline": "Equinix Rallies on Strong 2026 Forecast",
          "summary": "Digital infrastructure company Equinix jumped 11.6% despite missing latest quarter earnings expectations, as its financial forecasts for 2026 surpassed analyst predictions and demand for its solutions remains high.",
          "ticker": "$EQIX",
          "price": "N/A",
          "change": "N/A",
          "changePercent": "+11.6%",
          "direction": "up"
        },
        {
          "id": "smurfitwestrock-gainer",
          "headline": "Smurfit Westrock Surges on Encouraging Outlook",
          "summary": "Packaging company Smurfit Westrock climbed 9.9%. This gain came despite a weaker profit report for the latest quarter, driven by encouraging financial targets set for the next five years.",
          "ticker": "$SMFT",
          "price": "N/A",
          "change": "N/A",
          "changePercent": "+9.9%",
          "direction": "up"
        },
        {
          "id": "applovin-loser",
          "headline": "AppLovin Drops Amid AI Competition Concerns",
          "summary": "AppLovin fell 15.5% even after reporting a stronger profit than expected for the latest quarter. The decline reflects ongoing worries among investors that AI-powered competitors could impact the software company's market position.",
          "ticker": "$APP",
          "price": "N/A",
          "change": "N/A",
          "changePercent": "-15.5%",
          "direction": "down"
        },
        {
          "id": "cisco-loser",
          "headline": "Cisco Systems Falls on Weak Guidance",
          "summary": "Cisco Systems shares dropped 7% after the networking equipment provider issued disappointing forward guidance, leading to negative investor sentiment regarding its revenue expectations.",
          "ticker": "$CSCO",
          "price": "N/A",
          "change": "N/A",
          "changePercent": "-7.0%",
          "direction": "down"
        }
      ]
    },
    {
      "id": "market-news",
      "title": "Market News",
      "cardType": "article",
      "layout": "list",
      "items": [
        {
          "id": "economic-data-fed",
          "headline": "Strong Jobs Report Reshapes Fed Rate Cut Expectations",
          "summary": "The Labor Department's report of 130,000 new nonfarm payrolls in January, significantly exceeding forecasts, has led traders to scale back expectations for Federal Reserve interest rate cuts. The likelihood of the central bank holding rates steady in the near term has risen to almost 40%. All eyes are now on Friday's Consumer Price Index (CPI) report for further clues on monetary policy.",
          "tags": [
            "Economic Data",
            "Federal Reserve",
            "Jobs Report",
            "Interest Rates"
          ]
        },
        {
          "id": "sector-analysis-ai",
          "headline": "AI Splits Market: Infrastructure Strong, Software Under Pressure",
          "summary": "The artificial intelligence (AI) frenzy continues to create divergence in the market. Companies involved in AI infrastructure, such as semiconductor firms, saw gains. Conversely, software services providers faced pressure due to concerns that AI automation tools could displace existing business models. Meta's announcement of a $10 billion investment in a new AI data center underscores the ongoing capital commitment to the sector.",
          "tags": [
            "Sector Analysis",
            "Technology",
            "AI",
            "Semiconductors",
            "Software"
          ]
        },
        {
          "id": "earnings-mcdonalds-porch",
          "headline": "Key Earnings: McDonald's Beats, Porch Group Surges After-Hours",
          "summary": "McDonald's ($MCD) saw its stock rise 1% after beating earnings estimates, driven by strong Q4 revenue and a 6.8% surge in U.S. same-store sales. Meanwhile, Porch Group Inc. ($PRCH) surged 21.87% in after-hours trading after reporting a narrower-than-expected Q4 loss. Conversely, Robinhood Markets ($HOOD) fell 8.8% despite a stronger profit, as revenue fell short of forecasts, and concerns about crypto trading slowdown persisted.",
          "tags": [
            "Earnings Report",
            "McDonald's",
            "Porch Group",
            "Robinhood"
          ]
        }
      ]
    }
  ]
}