{
  "generatedAt": "2026-02-23T07:53:00Z",
  "generatedBy": "stocks-agent",
  "feedType": "stocks",
  "title": "Daily Market Digest: Tariff Concerns Weigh on US Futures",
  "subtitle": "February 23, 2026",
  "badge": "LIVE",
  "sections": [
    {
      "id": "market-pulse",
      "title": "Market Pulse",
      "cardType": "breaking",
      "layout": "featured",
      "items": [
        {
          "id": "market-summary",
          "headline": "US Futures Drop Amid Renewed Tariff Uncertainty; Asian Markets Mixed",
          "summary": "US stock futures are trading lower this Monday morning, February 23, 2026, as President Donald Trump's statement about increasing global tariffs to 15% following a Supreme Court decision striking down his previous 'reciprocal' tariff policy has injected fresh uncertainty into the markets. This comes after Wall Street saw a volatile but ultimately higher close on Friday. Asian markets displayed mixed reactions, with Hong Kong leading gains while the Shanghai Composite declined. Overall market sentiment remains cautious, with the CNN Money Fear and Greed index indicating 'Fear' at the end of last week. Investors are also looking ahead to a busy week of economic data and key earnings reports, notably Nvidia's on Wednesday. Not financial advice.",
          "tags": [
            "Futures",
            "Tariffs",
            "Geopolitics",
            "Market Sentiment"
          ]
        }
      ]
    },
    {
      "id": "major-indices",
      "title": "Major Indices (Pre-Market Futures)",
      "cardType": "stat",
      "layout": "grid",
      "items": [
        {
          "id": "sp500-futures",
          "statLabel": "S&P 500 Futures",
          "statValue": "Down 0.72%",
          "statContext": "Indicates cautious open for broader market."
        },
        {
          "id": "nasdaq-futures",
          "statLabel": "NASDAQ Futures",
          "statValue": "Down 0.98%",
          "statContext": "Tech-heavy index futures under pressure."
        },
        {
          "id": "dow-futures",
          "statLabel": "DOW Futures",
          "statValue": "Down 0.64%",
          "statContext": "Industrial average futures reflecting broader dip."
        }
      ]
    },
    {
      "id": "top-movers",
      "title": "Top Movers (Pre-Market/Early Trading)",
      "cardType": "stock",
      "layout": "list",
      "items": [
        {
          "id": "idfc-first-bank",
          "headline": "IDFC First Bank Shares Slip on Fraud Allegations",
          "summary": "IDFC First Bank shares are reportedly slipping in pre-market trading today following allegations of a $65 million fraud. This incident adds to a period of financial strain for the bank, including a significant net profit decline in Q4 FY25.",
          "ticker": "$IDFCFIRSTB.NS",
          "price": "N/A",
          "change": "N/A",
          "changePercent": "N/A",
          "direction": "down",
          "tags": [
            "Banking",
            "Fraud",
            "India Market"
          ]
        },
        {
          "id": "premarket-note",
          "headline": "Specific US Pre-Market Movers Awaiting Further Data",
          "summary": "As of early Monday morning UTC, specific real-time top gainers and losers for the US market's pre-market session on February 23, 2026, with confirmed price and percentage changes, are still developing or not widely reported in current real-time feeds. Market participants are closely monitoring the impact of the latest tariff announcements.",
          "tags": [
            "Pre-Market",
            "Market Dynamics"
          ]
        }
      ]
    },
    {
      "id": "market-news",
      "title": "Market News",
      "cardType": "article",
      "layout": "list",
      "items": [
        {
          "id": "tariff-impact",
          "headline": "Trump's Renewed Tariff Plans Spark Market Uncertainty",
          "summary": "President Donald Trump's intent to raise global tariffs to 15% after a Supreme Court ruling against his previous 'reciprocal' tariff policy is a primary driver of today's cautious market sentiment. This new layer of trade policy uncertainty is impacting global trade dynamics and investor confidence.",
          "tags": [
            "Tariffs",
            "Trade Policy",
            "Geopolitics"
          ]
        },
        {
          "id": "fed-outlook",
          "headline": "Fed Remains Cautious on Rate Cuts, Awaiting Further Inflation Data",
          "summary": "Federal Reserve officials reiterated at their last meeting that they require further evidence of falling inflation before they would consider additional rate cuts. This stance keeps interest rate expectations in focus for investors.",
          "tags": [
            "Federal Reserve",
            "Interest Rates",
            "Inflation"
          ]
        },
        {
          "id": "earnings-week-ahead",
          "headline": "Nvidia Earnings Lead a Busy Week for Corporate Reports",
          "summary": "This week features several significant earnings reports, with Nvidia ($NVDA) on Wednesday drawing considerable attention for insights into the artificial intelligence sector. Other companies scheduled to report include Lucid ($LCID), Home Depot ($HD), AMC Entertainment ($AMC), Salesforce ($CRM), Snowflake ($SNOW), Baidu ($BIDU), and Warner Bros. Discovery ($WBD).",
          "tags": [
            "Earnings",
            "Nvidia",
            "AI",
            "Corporate News"
          ]
        },
        {
          "id": "economic-data-releases",
          "headline": "Key Economic Data Releases Scheduled for the Week",
          "summary": "Investors will be monitoring a series of economic data releases throughout the week. Today, factory orders data is expected. Tuesday will bring the S&P Case-Shiller Home Price Index, wholesale inventories, and consumer confidence. Later in the week, initial jobless claims on Thursday and the Producer Price Index (PPI) on Friday will provide further economic indicators.",
          "tags": [
            "Economic Data",
            "Inflation",
            "Consumer Confidence"
          ]
        },
        {
          "id": "commodity-moves",
          "headline": "Crude Oil Dips, Gold and Silver Rise in Early Trading",
          "summary": "In early Monday trading, benchmark U.S. crude oil prices have fallen. Conversely, the prices of gold and silver have seen increases, with gold up 1.9% and silver up 5.5%, potentially reflecting safe-haven demand amidst market uncertainty.",
          "tags": [
            "Commodities",
            "Oil",
            "Gold",
            "Silver"
          ]
        },
        {
          "id": "sector-trends",
          "headline": "Small Caps Outperformed in January; Tech and Materials Show Mixed Trends",
          "summary": "In January, small-cap stocks (Russell 2000) surged, outperforming large-cap counterparts, driven by lower interest rates and a rotation towards more cyclical and domestically focused sectors. Energy and Materials led sector gains for the month. While information technology and communication services showed strong Q4 earnings growth, the IT sector was among the worst performers in the S&P 500 in January, indicating shifting leadership.",
          "tags": [
            "Sector Analysis",
            "Small Caps",
            "Technology",
            "Materials"
          ]
        }
      ]
    }
  ]
}