{
  "generatedAt": "2026-02-28T16:31:00Z",
  "generatedBy": "stocks-agent",
  "feedType": "stocks",
  "title": "Daily Market Digest",
  "subtitle": "Friday, February 28, 2026",
  "badge": "LIVE",
  "sections": [
    {
      "id": "market-pulse",
      "title": "Market Pulse",
      "cardType": "breaking",
      "layout": "featured",
      "items": [
        {
          "id": "market-summary-feb28",
          "headline": "U.S. Stocks Retreat Amid Inflation Data and AI Disruption Concerns",
          "summary": "U.S. stock markets experienced declines on Friday as hotter-than-expected inflation data and ongoing fears regarding the economic impact of artificial intelligence weighed heavily on investor sentiment. Geopolitical tensions involving the U.S. and Iran also contributed to market unease, particularly impacting oil prices. A notable sector rotation was observed, with 'old economy' stocks like Energy and Utilities showing resilience amidst the broader market struggles.",
          "tags": [
            "Market Sentiment",
            "Inflation",
            "AI Fears",
            "Geopolitics"
          ],
          "timestamp": "2026-02-28T16:30:00Z"
        }
      ]
    },
    {
      "id": "major-indices",
      "title": "Major Indices",
      "cardType": "stat",
      "layout": "grid",
      "items": [
        {
          "id": "sp500-feb28",
          "statLabel": "S&P 500",
          "statValue": "6,817.88",
          "statContext": "Down 61 points, or 0.9%"
        },
        {
          "id": "nasdaq-feb28",
          "statLabel": "NASDAQ Composite",
          "statValue": "22,358.04",
          "statContext": "Sank 1.3%"
        },
        {
          "id": "dow-feb28",
          "statLabel": "Dow Jones Industrial Average",
          "statValue": "48,276.92",
          "statContext": "Tumbled 701 points, or 1.4%"
        }
      ]
    },
    {
      "id": "top-movers",
      "title": "Top Movers",
      "cardType": "stock",
      "layout": "grid",
      "items": [
        {
          "id": "slno-gainer",
          "headline": "Soleno Therapeutics Surges on Strong Q4 Earnings",
          "summary": "Soleno Therapeutics ($SLNO) climbed in pre-market trading after reporting a significant beat on its Q4 2025 earnings and revenue, driven by the successful launch of its drug VYKAT XR. This performance marks a pivotal shift to profitability for the company.",
          "ticker": "$SLNO",
          "price": "N/A",
          "change": "N/A",
          "changePercent": "+9.2%",
          "direction": "up"
        },
        {
          "id": "nflx-gainer",
          "headline": "Netflix Rises After Exiting Warner Bros. Discovery Bidding War",
          "summary": "Netflix ($NFLX) saw gains following its withdrawal from the bidding war for Warner Bros. Discovery, opting not to overpay after Paramount Skydance raised its bid. The company is poised to receive a $2.8 billion deal breakup fee.",
          "ticker": "$NFLX",
          "price": "N/A",
          "change": "N/A",
          "changePercent": "+13.75%",
          "direction": "up"
        },
        {
          "id": "xyz-gainer",
          "headline": "Block Jumps on Workforce Reduction News",
          "summary": "Block ($XYZ) shares jumped after the company announced plans to cut 40% of its workforce, a move attributed to advancements in artificial intelligence.",
          "ticker": "$XYZ",
          "price": "N/A",
          "change": "N/A",
          "changePercent": "+15%",
          "direction": "up"
        },
        {
          "id": "nvda-loser",
          "headline": "Nvidia Extends Post-Earnings Slide Amid AI Jitters",
          "summary": "Nvidia ($NVDA) continued its decline, extending its post-earnings slide and turning negative for 2026, as concerns over the AI sector amplified a broader sell-off in tech stocks.",
          "ticker": "$NVDA",
          "price": "N/A",
          "change": "N/A",
          "changePercent": "-4.16%",
          "direction": "down"
        },
        {
          "id": "axp-loser",
          "headline": "American Express Pulls Back on AI Disruption Fears",
          "summary": "American Express ($AXP) experienced a significant pullback over the last week of February, with fears that stablecoin-based technology could disrupt traditional card networks impacting the stock.",
          "ticker": "$AXP",
          "price": "$308.90",
          "change": "N/A",
          "changePercent": "-10.77% (weekly)",
          "direction": "down"
        }
      ]
    },
    {
      "id": "market-news",
      "title": "Market News",
      "cardType": "article",
      "layout": "list",
      "items": [
        {
          "id": "sector-rotation",
          "headline": "Sector Rotation Shifts Focus to 'Old Economy' Stocks",
          "summary": "February witnessed a notable rotation of investment funds away from technology and communication sectors towards 'old economy' stocks. Energy and Utilities emerged as leading sectors, with Energy posting a 9.43% gain and Utilities a 10.35% increase in February, partly driven by anticipated earnings boosts from AI capital spending and declining interest rates making dividend yields more attractive. The materials sector, particularly copper mining, is also showing a constructive long-term outlook.",
          "tags": [
            "Sector Analysis",
            "Energy",
            "Utilities",
            "Technology"
          ]
        },
        {
          "id": "economic-data-inflation",
          "headline": "Hotter-Than-Expected January PPI Fuels Fed Rate Cut Concerns",
          "summary": "U.S. producer prices rose 0.5% month-on-month in January, exceeding economists' expectations. Core Producer Price Index (PPI) also jumped from 3.3% to 3.6% in January. This hotter-than-expected inflation data has intensified worries that the Federal Reserve may delay interest rate cuts.",
          "tags": [
            "Economic Data",
            "Inflation",
            "Federal Reserve"
          ]
        },
        {
          "id": "geopolitical-oil",
          "headline": "Geopolitical Tensions Drive Oil Price Increases",
          "summary": "Escalating geopolitical tensions between the United States and Iran, particularly concerning a potential nuclear deal, led to a rise in crude oil prices. West Texas Intermediate (WTI) crude oil futures were up about 16% year-to-date in 2026.",
          "tags": [
            "Geopolitics",
            "Oil Prices",
            "Global Economy"
          ]
        },
        {
          "id": "earnings-sqm",
          "headline": "SQM Reports Strong 2025 Earnings Driven by Lithium and Iodine",
          "summary": "Sociedad Química y Minera de Chile S.A. ($SQM) reported net income of US$588.1 million for the twelve months ended December 31, 2025, a significant reversal from a prior-year loss. The company's revenues reached US$4,576.2 million, with strong performance in both its lithium and iodine divisions, particularly record iodine prices amid tight supply and strong demand.",
          "tags": [
            "Earnings Report",
            "SQM",
            "Lithium",
            "Iodine"
          ]
        },
        {
          "id": "carters-earnings",
          "headline": "Carter's Inc. Beats Q4 Earnings Expectations",
          "summary": "Carter's, Inc. ($CRI) reported its Q4 2025 earnings, with an EPS of $1.90 beating estimates by $0.20, and revenue of $925.45 million surpassing expectations by $2.59 million, marking a 7.65% year-over-year increase.",
          "tags": [
            "Earnings Report",
            "Carter's Inc.",
            "Retail"
          ]
        },
        {
          "id": "china-gdp",
          "headline": "China's Economy Expands 5% in 2025, Surpassing 140 Trillion Yuan",
          "summary": "China's economy expanded by 5% year-on-year in 2025, with its Gross Domestic Product (GDP) exceeding 140 trillion yuan ($20.4 trillion) for the first time. The country remains the world's second-largest economy and contributed approximately 30% to global economic expansion.",
          "tags": [
            "Global Economy",
            "China",
            "GDP"
          ]
        }
      ]
    }
  ]
}