{
  "generatedAt": "2026-02-18T12:38:00Z",
  "generatedBy": "stocks-agent",
  "feedType": "stocks",
  "title": "Daily Market Digest",
  "subtitle": "Wednesday, February 18, 2026",
  "badge": "LIVE",
  "sections": [
    {
      "id": "market-pulse",
      "title": "Market Pulse",
      "cardType": "breaking",
      "layout": "featured",
      "items": [
        {
          "id": "market-summary-feb18",
          "headline": "U.S. Stocks Edge Higher Amid Cautious Optimism; Futures Climb Pre-Market",
          "summary": "U.S. stock markets closed slightly higher on Tuesday, February 17, with all three major indices posting modest gains despite underlying swings and lingering concerns about artificial intelligence's impact on tech. Pre-market trading for Wednesday, February 18, shows futures advancing, suggesting a positive open. Overall market sentiment reflects cautious optimism, driven by a mix of economic data, geopolitical events, and upcoming central bank signals. Not financial advice.",
          "tags": [
            "Market Overview",
            "Sentiment",
            "AI"
          ]
        }
      ]
    },
    {
      "id": "major-indices",
      "title": "Major Indices (February 17, 2026 Close)",
      "cardType": "stat",
      "layout": "grid",
      "items": [
        {
          "id": "sp500-close",
          "statLabel": "S&P 500",
          "statValue": "6,843.22",
          "statContext": "+0.1% (⬆️ 7.05 points)"
        },
        {
          "id": "nasdaq-close",
          "statLabel": "NASDAQ Composite",
          "statValue": "22,578.38",
          "statContext": "+0.1% (⬆️ 31.71 points)"
        },
        {
          "id": "dow-close",
          "statLabel": "Dow Jones Industrial Average",
          "statValue": "49,553.19",
          "statContext": "+0.1% (⬆️ 32.26 points)"
        },
        {
          "id": "sp500-futures",
          "statLabel": "S&P 500 E-mini Futures (Pre-market)",
          "statValue": "+0.5%",
          "statContext": "⬆️"
        },
        {
          "id": "nasdaq-futures",
          "statLabel": "NASDAQ 100 Futures (Pre-market)",
          "statValue": "+0.6%",
          "statContext": "⬆️"
        },
        {
          "id": "dow-futures",
          "statLabel": "Dow Futures (Pre-market)",
          "statValue": "+0.4%",
          "statContext": "⬆️"
        }
      ]
    },
    {
      "id": "top-movers",
      "title": "Top Movers (February 17-18, 2026)",
      "cardType": "stock",
      "layout": "grid",
      "items": [
        {
          "id": "paramount",
          "headline": "Paramount Skydance surges on Warner Bros. bid prospects",
          "ticker": "$PARA",
          "price": "N/A",
          "change": "N/A",
          "changePercent": "+4.9%",
          "direction": "up",
          "summary": "Paramount Skydance gained significantly after Warner Bros. Discovery announced it would allow Paramount a chance to submit its 'best and final' bid to acquire the entertainment company."
        },
        {
          "id": "apple",
          "headline": "Apple sees gains among AI leaders",
          "ticker": "$AAPL",
          "price": "N/A",
          "change": "N/A",
          "changePercent": "+3.2%",
          "direction": "up",
          "summary": "Apple benefited from selective positioning within AI leaders, contributing to its rise."
        },
        {
          "id": "citigroup",
          "headline": "Citigroup outperforms as financials show resilience",
          "ticker": "$C",
          "price": "N/A",
          "change": "N/A",
          "changePercent": "+2.7%",
          "direction": "up",
          "summary": "Citigroup's stock rose as the financial sector outperformed, reinforced by expectations for resilient net interest margins following comments from Fed Governor Michael Barr."
        },
        {
          "id": "general-mills",
          "headline": "General Mills tumbles on uneasy customer outlook",
          "ticker": "$GIS",
          "price": "N/A",
          "change": "N/A",
          "changePercent": "-7.0%",
          "direction": "down",
          "summary": "General Mills' stock sank after the company warned that its customers are feeling uneasy, leading to a cut in its profit forecast for 2026."
        },
        {
          "id": "genuine-parts",
          "headline": "Genuine Parts drops on weaker results and planned split",
          "ticker": "$GPC",
          "price": "N/A",
          "change": "N/A",
          "changePercent": "-14.6%",
          "direction": "down",
          "summary": "Genuine Parts reported weaker results for the latest quarter than analysts expected and plans to split into two separate publicly traded companies by early 2027."
        },
        {
          "id": "salesforce",
          "headline": "Salesforce declines amid rotation out of software stocks",
          "ticker": "$CRM",
          "price": "N/A",
          "change": "N/A",
          "changePercent": "-2.9%",
          "direction": "down",
          "summary": "Investors continued to rotate out of richly valued software stocks, causing Salesforce's share price to fall."
        }
      ]
    },
    {
      "id": "market-news",
      "title": "Market News",
      "cardType": "article",
      "layout": "list",
      "items": [
        {
          "id": "sector-analysis",
          "headline": "Sector Performance: Utilities, Real Estate Lead; Tech, Financials Lag",
          "summary": "On Tuesday, the Utilities Select Sector SPDR ($XLU) advanced 2.8%, the Real Estate Select Sector SPDR ($XLRE) gained 1.5%, and the Health Care Select Sector SPDR ($XLV) rose 1.1%. The Materials Select Sector SPDR ($XLB) also saw a 0.9% increase. Conversely, the technology and financials sectors continue to lag, with a notable rotation towards energy, materials, and industrials. AI disruption fears persist, particularly affecting software stocks, with companies like CrowdStrike ($CRWD) and ServiceNow ($NOW) experiencing declines. Not financial advice.",
          "tags": [
            "Sector Analysis",
            "Technology",
            "Financials",
            "Utilities",
            "Real Estate"
          ]
        },
        {
          "id": "fomc-minutes",
          "headline": "FOMC Minutes Release Eyed by Investors for Rate Clues",
          "summary": "The minutes from the Federal Reserve's January meeting are scheduled for release today, February 18, 2026. Traders are closely watching these minutes for clearer guidance on the trajectory of interest rates and to assess policymakers' leanings on future rate cuts or sustained restrictive policy. Not financial advice.",
          "tags": [
            "Economic News",
            "Federal Reserve",
            "Interest Rates"
          ]
        },
        {
          "id": "economic-data",
          "headline": "Key Economic Data Releases: Housing, Durable Goods",
          "summary": "Today's economic calendar includes the release of data on New Residential Construction (Building Permits, Housing Starts) and Durable Goods Orders. These figures will provide further insights into the health of the U.S. economy. Additionally, the U.S. 10-year Treasury yield is near 4.07%, while WTI crude oil futures are trending higher around $62.61 per barrel. Not financial advice.",
          "tags": [
            "Economic News",
            "Housing",
            "Manufacturing"
          ]
        },
        {
          "id": "earnings-reports",
          "headline": "Major Companies Report Earnings: Moody's, Dana, Openlane",
          "summary": "Moody's Corporation ($MCO) and Dana Incorporated ($DAN) announced their fourth-quarter and full-year 2025 financial results today. Openlane ($OPLN) also posted its quarterly earnings. Other companies expected to release results today include Booking Holdings ($BKNG), Occidental Petroleum ($OXY), Analog Devices ($ADI), Carvana ($CVNA), Garmin Ltd. ($GRMN), and Bausch Health Companies Inc. ($BHC). Not financial advice.",
          "tags": [
            "Economic News",
            "Earnings Reports"
          ]
        },
        {
          "id": "ai-impact-news",
          "headline": "AI Dominates Industry News: Chip Shortages, Autonomous Driving, Cybersecurity",
          "summary": "The ongoing boom in artificial intelligence continues to shape industry news. Reports suggest that the launch of Sony's PlayStation 6 may be delayed due to a shortage of memory chips, exacerbated by the demand from AI data centers. Meanwhile, Continental is set to open the Tire Technology Expo with a presentation on tire technologies specifically for autonomous driving, highlighting the integration of AI in automotive advancements. In cybersecurity, fears of AI impacting existing business models continue to weigh on software stocks. Not financial advice.",
          "tags": [
            "Industry News",
            "AI",
            "Technology",
            "Automotive"
          ]
        }
      ]
    }
  ]
}