{
  "generatedAt": "2026-02-21T07:31:00Z",
  "generatedBy": "stocks-agent",
  "feedType": "stocks",
  "title": "Daily Market Digest",
  "subtitle": "February 21, 2026 - Weekend Market Wrap-up",
  "badge": "End of Day Summary",
  "sections": [
    {
      "id": "market-pulse-20260221",
      "title": "Market Pulse: Tariffs Drive Volatility Amid Economic Concerns",
      "cardType": "breaking",
      "layout": "featured",
      "items": [
        {
          "id": "mp-item-1",
          "headline": "US Stocks Finish Higher After Supreme Court Strikes Down Trump Tariffs, But New Levies Loom",
          "summary": "US stock markets closed higher on Friday, February 20, 2026, as investors reacted to a Supreme Court decision overturning President Donald Trump's broad tariff policy. However, the gains were tempered by weak fourth-quarter GDP data and Trump's swift move to impose a new 10% global tariff, creating renewed uncertainty for the week ahead. Market sentiment remains cautious amid persistent inflation and potential Fed rate adjustments.",
          "tags": [
            "Market Sentiment",
            "Tariffs",
            "GDP",
            "Inflation"
          ]
        }
      ]
    },
    {
      "id": "major-indices-20260221",
      "title": "Major Indices Performance (Feb 20, 2026)",
      "cardType": "stat",
      "layout": "grid",
      "items": [
        {
          "id": "sp500-stat",
          "statLabel": "S&P 500",
          "statValue": "6,909.51",
          "statContext": "Up 0.69% for the day, 0.95% for the week."
        },
        {
          "id": "nasdaq-stat",
          "statLabel": "NASDAQ Composite",
          "statValue": "22,935.00",
          "statContext": "Up 1.11% for the day, 1.42% for the week, snapping a five-week losing streak."
        },
        {
          "id": "dow-stat",
          "statLabel": "Dow Jones Industrial Average",
          "statValue": "49,515.45",
          "statContext": "Up 0.24% for the day, 0.19% for the week."
        }
      ]
    },
    {
      "id": "top-movers-20260221",
      "title": "Top Movers (Feb 20, 2026 Close)",
      "cardType": "stock",
      "layout": "grid",
      "items": [
        {
          "id": "gainer-glw",
          "headline": "Corning Surges on Market Optimism",
          "ticker": "$GLW",
          "price": "$139.46",
          "change": "+$9.45",
          "changePercent": "+7.29%",
          "direction": "up",
          "summary": "Corning Incorporated saw a significant jump in its stock price, benefiting from the broader market's positive reaction to the Supreme Court's tariff ruling."
        },
        {
          "id": "gainer-amzn",
          "headline": "Amazon Rises as Trade Uncertainty Eases",
          "ticker": "$AMZN",
          "price": "$210.19",
          "change": "+$5.33",
          "changePercent": "+2.60%",
          "direction": "up",
          "summary": "Amazon.com Inc. experienced gains as lower trade risk, following the Supreme Court's decision, boosted tech and retail shares."
        },
        {
          "id": "loser-akam",
          "headline": "Akamai Technologies Suffers Sharp Decline",
          "ticker": "$AKAM",
          "price": "N/A",
          "change": "-14.1%",
          "changePercent": "-14.10%",
          "direction": "down",
          "summary": "Akamai Technologies experienced one of the market's sharpest losses."
        },
        {
          "id": "loser-jnj",
          "headline": "Johnson & Johnson Falls",
          "ticker": "$JNJ",
          "price": "$242.49",
          "change": "-$4.42",
          "changePercent": "-1.79%",
          "direction": "down",
          "summary": "Johnson & Johnson stock fell by 1.79% during Friday's trading session."
        }
      ]
    },
    {
      "id": "market-news-20260221",
      "title": "Market News & Analysis",
      "cardType": "article",
      "layout": "list",
      "items": [
        {
          "id": "news-tariffs-ruling",
          "headline": "Supreme Court Strikes Down Trump Tariffs, But President Imposes New Global Levy",
          "summary": "The U.S. Supreme Court ruled against President Donald Trump's sweeping tariffs imposed under the 1977 International Emergency Economic Powers Act. However, Trump quickly signed an executive order for a new 10% global tariff under Section 122 of the Trade Act of 1974, signaling continued protectionist measures and keeping investors cautious.",
          "tags": [
            "Trade Policy",
            "Supreme Court",
            "Tariffs"
          ]
        },
        {
          "id": "news-gdp-inflation",
          "headline": "Q4 2025 US GDP Disappoints, Inflation Remains Elevated",
          "summary": "The U.S. economy expanded at an annual rate of 1.4% in the fourth quarter of 2025, significantly below the 4.4% growth from the previous quarter and analyst forecasts of 2.5%. This slowdown was partly attributed to a federal government shutdown and reduced consumer spending. The Federal Reserve's preferred inflation gauge also rose to 2.9% in December, up from November, indicating persistent inflationary pressures that could influence future interest rate decisions.",
          "tags": [
            "Economic Data",
            "GDP",
            "Inflation",
            "Federal Reserve"
          ]
        },
        {
          "id": "news-sector-rotation",
          "headline": "Sector Rotation Towards Value and Defensive Stocks Continues in Early 2026",
          "summary": "Early 2026 has seen a rotation into value stocks, with sectors like Energy, Healthcare, and Industrials outperforming technology. While the overall market profile for 2026 is described as defensive, Communication Services and Industrials led gains for the week ending Feb 20, with Consumer Defensives and Utilities lagging.",
          "tags": [
            "Sector Analysis",
            "Value Stocks",
            "Growth Stocks"
          ]
        },
        {
          "id": "news-earnings",
          "headline": "Vanda Pharma Awaits Bysanti Decision; Nvidia Earnings Next Week",
          "summary": "Vanda Pharmaceuticals ($VNDA) reported its Q4 and full-year 2025 financial results, with a PDUFA target action date of February 21, 2026, for its Bysanti new drug application. Meanwhile, investors are looking ahead to next week's earnings report from Nvidia ($NVDA), a key player in the AI sector.",
          "tags": [
            "Earnings Reports",
            "Biotechnology",
            "Technology"
          ]
        }
      ]
    }
  ]
}