{
  "generatedAt": "2026-02-14T07:32:00Z",
  "generatedBy": "stocks-agent",
  "feedType": "stocks",
  "title": "Daily Market Digest",
  "subtitle": "February 14, 2026: Weekend Market Wrap-up and Economic Outlook",
  "badge": "Weekend Edition",
  "sections": [
    {
      "id": "market-pulse-1",
      "title": "Market Pulse",
      "cardType": "breaking",
      "layout": "featured",
      "items": [
        {
          "id": "market-summary-1",
          "headline": "U.S. Markets Close Mixed on Friday, Inflation Data Milder Than Expected",
          "summary": "U.S. equities concluded Friday's session with a mixed performance, as milder-than-expected inflation data provided some optimism for potential rate cuts, while persistent concerns over artificial intelligence disruption weighed on technology stocks. Major indices saw slight movements, with the S&P 500 and Dow Jones posting minor gains, while the Nasdaq Composite experienced a modest decline. Trading volume was below the 20-day average, with market breadth showing more advancing stocks than decliners on both the NYSE and Nasdaq. The upcoming Presidents' Day holiday on Monday will keep U.S. markets closed.",
          "tags": [
            "Market Sentiment",
            "CPI",
            "AI Concerns"
          ]
        }
      ]
    },
    {
      "id": "major-indices-1",
      "title": "Major Indices",
      "cardType": "stat",
      "layout": "grid",
      "items": [
        {
          "id": "sp500-stat",
          "statLabel": "S&P 500",
          "statValue": "6,836.17",
          "statContext": "+0.05% on Friday, Feb 13"
        },
        {
          "id": "nasdaq-stat",
          "statLabel": "NASDAQ Composite",
          "statValue": "22,546.67",
          "statContext": "-0.22% on Friday, Feb 13"
        },
        {
          "id": "dow-stat",
          "statLabel": "Dow Jones Industrial Average",
          "statValue": "49,500.93",
          "statContext": "+0.10% on Friday, Feb 13"
        }
      ]
    },
    {
      "id": "top-movers-1",
      "title": "Top Movers (Friday, February 13, 2026)",
      "cardType": "stock",
      "layout": "grid",
      "items": [
        {
          "id": "amat-gainer",
          "headline": "Applied Materials Surges on Strong Earnings",
          "summary": "Applied Materials ($AMAT) surged 8.08% on Friday after the world's largest semiconductor equipment maker reported stronger-than-expected earnings for fiscal Q1 2026, significantly beating market expectations amid a semiconductor boom.",
          "ticker": "$AMAT",
          "price": "N/A",
          "change": "N/A",
          "changePercent": "+8.08%",
          "direction": "up",
          "timestamp": "2026-02-13T16:00:00Z"
        },
        {
          "id": "rivn-gainer",
          "headline": "Rivian Jumps on Q4 Results and 2026 Delivery Forecast",
          "summary": "Rivian Automotive ($RIVN) zoomed up more than 20% on Friday after reporting a narrower-than-expected fourth-quarter loss and higher-than-expected revenue. The electric vehicle company also projected a 53% increase in 2026 deliveries, driven by its new, more affordable R2 SUVs.",
          "ticker": "$RIVN",
          "price": "N/A",
          "change": "N/A",
          "changePercent": "+20% (approx.)",
          "direction": "up",
          "timestamp": "2026-02-13T16:00:00Z"
        },
        {
          "id": "roku-gainer",
          "headline": "Roku Soars on Exceeded Earnings and Strong Guidance",
          "summary": "Roku ($ROKU) jumped 14% after the streaming platform provider reported fourth-quarter earnings that significantly exceeded analyst expectations and issued strong guidance for 2026.",
          "ticker": "$ROKU",
          "price": "N/A",
          "change": "N/A",
          "changePercent": "+14%",
          "direction": "up",
          "timestamp": "2026-02-13T16:00:00Z"
        },
        {
          "id": "pins-loser",
          "headline": "Pinterest Slumps on Weak Revenue Forecast",
          "summary": "Pinterest ($PINS) slumped 21% on Friday after the image-sharing platform forecast first-quarter revenue estimates below expectations, facing intensified competition and advertising spending cutbacks.",
          "ticker": "$PINS",
          "price": "N/A",
          "change": "N/A",
          "changePercent": "-21%",
          "direction": "down",
          "timestamp": "2026-02-13T16:00:00Z"
        }
      ]
    },
    {
      "id": "market-news-1",
      "title": "Market News",
      "cardType": "article",
      "layout": "list",
      "items": [
        {
          "id": "cpi-report-1",
          "headline": "January CPI Eases, Bolstering Rate Cut Hopes",
          "summary": "The January Consumer Price Index (CPI) came in milder than expected, with headline CPI rising 0.2% month-over-month (below the 0.3% forecast) and 2.4% year-over-year (the lowest in eight months). Core CPI also moderated to 2.5% year-over-year, its lowest since March 2021. This data has led traders to increase the probability of a Federal Reserve rate cut in June to 52.3%.",
          "tags": [
            "Economic Data",
            "Inflation",
            "Federal Reserve"
          ]
        },
        {
          "id": "ai-concerns-1",
          "headline": "AI Disruption Concerns Weigh on Tech Sector",
          "summary": "Persistent concerns over artificial intelligence (AI) disruption continued to impact the technology sector, with heavyweight technology and communications stocks weakening. The Nasdaq Composite's decline on Friday was partly attributed to these AI-related jitters, particularly affecting software companies.",
          "tags": [
            "Technology",
            "AI",
            "Market Sentiment"
          ]
        },
        {
          "id": "economic-calendar-upcoming",
          "headline": "Quiet Weekend and Holiday Ahead for U.S. Markets",
          "summary": "U.S. markets are closed today, Saturday, February 14, and will also be closed on Monday, February 16, in observance of Presidents' Day. Investors will look to next week's economic calendar for further insights, which is expected to include the advance estimate of fourth-quarter GDP and December's personal income and outlays aggregates.",
          "tags": [
            "Economic Calendar",
            "Market Holiday"
          ]
        }
      ]
    }
  ]
}