{
  "generatedAt": "2026-02-17T17:01:00Z",
  "generatedBy": "stocks-agent",
  "feedType": "stocks",
  "title": "Daily Market Digest",
  "subtitle": "February 17, 2026",
  "badge": "LIVE",
  "sections": [
    {
      "id": "market-pulse-overview",
      "title": "Market Pulse",
      "cardType": "breaking",
      "layout": "featured",
      "items": [
        {
          "id": "market-summary-001",
          "headline": "Uneasy Trading Dominates as AI Concerns Persist Amid Mixed Economic Data",
          "summary": "U.S. equity markets experienced a mixed to lower session today as concerns surrounding the impact of artificial intelligence on various sectors and cautious consumer sentiment weighed on investor mood. While some major indices saw marginal gains or slight declines, the overall tone remained uneasy. Futures had indicated a softer opening following a holiday-shortened week, with a focus on upcoming economic data and earnings reports.",
          "tags": [
            "Market Sentiment",
            "AI Impact",
            "Economic Data"
          ],
          "timestamp": "2026-02-17T17:01:00Z"
        }
      ]
    },
    {
      "id": "major-indices-performance",
      "title": "Major Indices",
      "cardType": "stat",
      "layout": "grid",
      "items": [
        {
          "id": "sp500-stat",
          "statLabel": "S&P 500",
          "statValue": "6,836.17",
          "statContext": "Closed mixed, with some reports showing a slight gain of 0.1%, while others indicated a fall of 0.5% after earlier gains."
        },
        {
          "id": "nasdaq-stat",
          "statLabel": "NASDAQ Composite",
          "statValue": "22,546.67",
          "statContext": "Slid 0.2% due to weak performance from AI-related stocks. Other reports indicated a larger drop of 0.7% to 1.2% lower."
        },
        {
          "id": "dow-stat",
          "statLabel": "Dow Jones Industrial Average",
          "statValue": "49,500.93",
          "statContext": "Fell 0.1% after a choppy session. Some reports noted a decline of 167 points, or 0.3%."
        }
      ]
    },
    {
      "id": "top-movers",
      "title": "Top Movers",
      "cardType": "stock",
      "layout": "grid",
      "items": [
        {
          "id": "zim-gainer",
          "headline": "ZIM Integrated Shipping Soars on Acquisition News",
          "summary": "Shares of ZIM Integrated Shipping jumped 31% after Hapag-Lloyd agreed to acquire the shipper for $35 per share in cash, representing a significant premium.",
          "ticker": "$ZIM",
          "price": "N/A",
          "change": "N/A",
          "changePercent": "+31.00%",
          "direction": "up"
        },
        {
          "id": "amat-gainer",
          "headline": "Applied Materials Inc. Rises on Strong Earnings",
          "summary": "Applied Materials Inc. saw its shares climb 8.1% following a report of strong first-quarter fiscal 2026 adjusted earnings of $2.38 per share, surpassing analyst estimates.",
          "ticker": "$AMAT",
          "price": "N/A",
          "change": "N/A",
          "changePercent": "+8.10%",
          "direction": "up"
        },
        {
          "id": "roku-gainer",
          "headline": "Roku Inc. Jumps After Exceeding Earnings Estimates",
          "summary": "Roku Inc. shares surged 8.6% after the company reported fourth-quarter 2025 adjusted earnings of $0.53 per share, significantly exceeding the Zacks Consensus Estimate.",
          "ticker": "$ROKU",
          "price": "N/A",
          "change": "N/A",
          "changePercent": "+8.60%",
          "direction": "up"
        },
        {
          "id": "kwality-loser",
          "headline": "Kwality Wall's Experiences Significant Drop",
          "summary": "Kwality Wall's (India) shares fell 5.00% to ₹27.95, hitting a day's low on its second day of listing and now down 30% from its demerger price.",
          "ticker": "N/A",
          "price": "₹27.95",
          "change": "-₹1.47",
          "changePercent": "-5.00%",
          "direction": "down"
        },
        {
          "id": "gis-loser",
          "headline": "General Mills Declines on Consumer Confidence Concerns",
          "summary": "General Mills sank 7.2% after the company indicated that customers are feeling less confident, leading to a cut in its profit forecast for 2026.",
          "ticker": "$GIS",
          "price": "N/A",
          "change": "N/A",
          "changePercent": "-7.20%",
          "direction": "down"
        },
        {
          "id": "eil-loser",
          "headline": "Engineers India Falls Amid Profit Booking",
          "summary": "Shares of state-owned Engineers India (EIL) closed 5% lower on the NSE, as investors engaged in profit booking after a significant rally on Monday.",
          "ticker": "$EIL",
          "price": "₹215.27",
          "change": "N/A",
          "changePercent": "-5.00%",
          "direction": "down"
        }
      ]
    },
    {
      "id": "market-news",
      "title": "Market News",
      "cardType": "article",
      "layout": "list",
      "items": [
        {
          "id": "sector-performance-overview",
          "headline": "Mixed Sector Performance: IT and PSU Banks Lead, Metals and Realty Lag",
          "summary": "Today's market saw a divergence in sector performance. In India, PSU Bank surged 2.36%, followed by IT (1.15%), Industrials (1.13%), and FMCG (0.87%). Conversely, the Metal and Realty sectors were among the primary laggards, grappling with a softening global demand outlook and elevated interest rates.",
          "tags": [
            "Sector Analysis",
            "Indian Market",
            "Global Trends"
          ],
          "timestamp": "2026-02-17T17:01:00Z"
        },
        {
          "id": "economic-inflation-report",
          "headline": "Inflation Ticks Down in Canada and U.S.",
          "summary": "Canada's annual inflation rate eased to 2.3% in January, down from 2.4% in December, largely attributed to lower gas prices and easing shelter costs. In the U.S., the consumer price index (CPI) rose 0.2% month-over-month in January, below the 0.3% consensus estimate, with the year-over-year headline CPI at 2.4%.",
          "tags": [
            "Economic Data",
            "Inflation",
            "Canada",
            "United States"
          ],
          "timestamp": "2026-02-17T17:01:00Z"
        },
        {
          "id": "earnings-medtronic-leidos",
          "headline": "Medtronic and Leidos Report Strong Earnings",
          "summary": "Medtronic ($MDT) announced robust third-quarter fiscal 2026 results, achieving 6% organic revenue growth, surpassing its guidance. Leidos ($LDOS) also exceeded expectations with fourth-quarter earnings of $2.76 per share, beating the Zacks Consensus Estimate. Other companies scheduled to report earnings today include Axcelis Technologies ($ACLS) and Cadence Design ($CDNS).",
          "tags": [
            "Earnings Report",
            "Healthcare",
            "Technology"
          ],
          "timestamp": "2026-02-17T17:01:00Z"
        },
        {
          "id": "macro-ai-disruption",
          "headline": "AI Disruption Fears Continue to Shape Market Sentiment",
          "summary": "Artificial intelligence-related disruption fears continue to impact market sentiment, especially weighing on tech and financial stocks. Some sectors like software, financial services, and media have experienced sell-offs as investors assess potential losers in an AI-remade world.",
          "tags": [
            "Macro Trends",
            "Artificial Intelligence",
            "Market Risk"
          ],
          "timestamp": "2026-02-17T17:01:00Z"
        },
        {
          "id": "global-lunar-new-year",
          "headline": "Asian Markets Closed for Lunar New Year",
          "summary": "Most Asian markets were closed today in observance of the Lunar New Year holidays, leading to a quieter trading day in the region. China is looking to boost domestic consumption during this festive period.",
          "tags": [
            "Global Markets",
            "Asia",
            "Holiday Impact"
          ],
          "timestamp": "2026-02-17T17:01:00Z"
        }
      ]
    }
  ]
}